// 正序分解整数
// 第四周样例 4 中讲了如何输出逆序的整数，这里是正序
// 输入： 13425
// 输出： 1 3 4 2 5

#include <stdio.h>

int main() {
    int x;
    scanf("%d", &x);

    // 思路：先求逆序的数字再逆序输出
    // 求逆序
    // int t = 0;
    // do {
    //     int d = x % 10;     // 获取个位数
    //     t = t * 10 + d;
    //     x /= 10;
    // } while (x > 0);
    // x = t;

    // // 输出逆序
    // do {
    //     int d = x % 10;
    //     printf("%d", d);
    //     if (x >= 10) {
    //         printf(" ");
    //     }
    //     x /= 10;
    // } while (x > 0);
    // 问题：如果输入的数末尾有 0 ，那么 0 就不会输出
    // 如输入 700 ，输出就只有 7

    // 因此要换一个思路，直接正序取余、输出
    // eg. 13425
    // 13425 / 10000 = 1    <- 1
    // 13425 % 10000 = 3425
    // 10000 / 10    = 1000
    // 3425 / 1000 = 3      <- 3
    // 3425 % 1000 = 425
    // 1000 / 10   = 100
    // 425 / 100 = 4        <- 4
    // 425 % 100 = 25
    // 100 / 10 = 10
    // 25 / 10 = 2          <- 2
    // 25 % 10 = 5
    // 10 / 10 = 1
    // 5 / 1  = 5           <- 5
    // 5 % 1  = 0
    // 1 / 10 = 0

    // 计算整数的位数，获得 mask 的值
    // 如 5 位数， mask 应该是 10000
    int mask = 1;
    int t = x;
    while (t >= 10) {
        t /= 10;
        mask *= 10;
    }

    do {
        int d = x / mask;
        printf("%d", d);
        if (mask > 9) {
            printf(" ");
        }
        x %= mask;
        mask /= 10;
    } while (mask > 0);

    printf("\n");
    return 0;
}